# St7SetLoadPathTemplateLaneFactor

Assigns the lane factor for the specified load path template.

long St7SetLoadPathTemplateLaneFactor(long uID, long TemplateID, long Lane,

double Factor)

Input Parameters

uID

Strand7 model file ID.

TemplateID

Load path template ID.

Lane

Lane number.

Factor

Lane factor.